Tekla Open API Reference for Tekla Structures 2025
PhaseCollection.IsSynchronized Property
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSynchronized { get; }
Public ReadOnly Property IsSynchronized As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection.IsSynchronized
See Also
Reference
PhaseCollection Class
Tekla.Structures.Model Namespace